module.exports = [
  {
    text: "指南",
    link: "/pages/introduction/",
    items: [
      { text: "介绍", link: "/pages/introduction/" },
      { text: "快速开始", link: "/pages/start/" },
      { text: "目录结构", link: "/pages/directory/" },
      { text: "vscode文件夹详解", link: "/pages/vscode/" },
      { text: "平台配置", link: "/pages/config/" },
      { text: "布局", link: "/pages/layout/" },
      { text: "路由和菜单", link: "/pages/routerMenu/" },
      { text: "http请求", link: "/pages/request/" },
      { text: "打包和部署", link: "/pages/build/" },
      {
        text: "进阶",
        items: [
          { text: "图标", link: "/pages/icon/" },
          { text: "主题和暗黑模式", link: "/pages/theme/" },
          { text: "国际化", link: "/pages/i18n/" },
          { text: "Tailwind CSS", link: "/pages/tailwindcss/" },
          { text: "RBAC权限", link: "/pages/RBAC/" },
          { text: "类型声明", link: "/pages/typescript/" },
          { text: "单点登录", link: "/pages/sso/" },
          { text: "自定义免登录", link: "/pages/nologin/" },
          { text: "打包优化", link: "/pages/buildgood/" },
          { text: "vite预构建", link: "/pages/optimize/" },
        ],
      },
      {
        text: "生态",
        items: [
          { text: "对接平台的前后端项目", link: "/pages/opensource/" },
          { text: "函数工具库", link: "/pages/utils/" },
          { text: "组件库", link: "/pages/components/" },
          { text: "vite插件", link: "/pages/viteplugin/" },
        ],
      },
      {
        text: "其他",
        items: [
          { text: "常见问题", link: "/pages/FAQ/" },
          { text: "非平台问题跟踪记录", link: "/pages/track/" },
          { text: "git常用命令", link: "/pages/git/" },
          { text: "技术网站推荐", link: "/pages/recommendation/" },
        ],
      },
    ],
  },
  {
    text: "链接",
    items: [
      {
        text: "后端项目",
        link: "/pages/opensource/",
      },
      {
        text: "日志",
        items: [
          {
            text: "Github日志",
            link: "https://github.com/pure-admin/vue-pure-admin/releases",
          },
          {
            text: "Gitee日志",
            link: "https://gitee.com/yiming_chang/vue-pure-admin/releases",
          },
        ],
      },
      {
        text: "预览",
        items: [
          {
            text: "完整版",
            link: "https://pure-admin.github.io/vue-pure-admin/#/login",
          },
          {
            text: "精简版",
            link: "https://pure-admin-thin.netlify.app/#/login",
          },
          {
            text: "max版",
            link: "https://pure-admin.github.io/vue-pure-admin-max/#/login",
          },
          {
            text: "utils文档",
            link: "https://pure-admin-utils.netlify.app/",
          },
        ],
      },
      {
        text: "Github源码",
        items: [
          {
            text: "完整版",
            link: "https://github.com/pure-admin/vue-pure-admin",
          },
          {
            text: "精简版",
            link: "https://github.com/pure-admin/pure-admin-thin",
          },
          {
            text: "Tauri版",
            link: "https://github.com/pure-admin/tauri-pure-admin",
          },
          {
            text: "Electron版",
            link: "https://github.com/pure-admin/electron-pure-admin",
          },
          {
            text: "配套后端",
            link: "https://github.com/pure-admin/pure-admin-backend",
          },
          {
            text: "文档",
            link: "https://github.com/pure-admin/pure-admin-doc",
          },
          {
            text: "utils文档",
            link: "https://github.com/pure-admin/pure-admin-utils-docs",
          },
        ],
      },
      {
        text: "Gitee源码",
        items: [
          {
            text: "完整版",
            link: "https://gitee.com/yiming_chang/vue-pure-admin",
          },
          {
            text: "精简版",
            link: "https://gitee.com/yiming_chang/pure-admin-thin",
          },
          {
            text: "Tauri版",
            link: "https://gitee.com/yiming_chang/tauri-pure-admin",
          },
          {
            text: "Electron版",
            link: "https://gitee.com/yiming_chang/electron-pure-admin",
          },
          {
            text: "配套后端",
            link: "https://gitee.com/yiming_chang/pure-admin-backend",
          },
          {
            text: "文档",
            link: "https://gitee.com/yiming_chang/pure-admin-doc",
          },
          {
            text: "utils文档",
            link: "https://gitee.com/yiming_chang/pure-admin-utils-docs",
          },
        ],
      },
    ],
  },
  {
    text: "优质服务",
    link: "/pages/service/",
    // icon: `<svg t="1668145036658" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" width="20"
    //       height="20">
    //       <path
    //         d="M428.6976 107.3152c-6.5024 72.192-36.352 207.2576-160.256 337.408 3.6864-48.0256-7.1168-83.7632-19.0464-107.6736-6.6048-13.1584-26.0608-10.5984-28.8768 3.84-5.7344 29.44-20.5824 75.0592-57.6 137.7792-71.6288 121.3952-62.5664 459.8784 340.736 459.8784s430.4384-352.8192 373.1456-496.0256c-37.376-93.44-93.952-152.5248-128.8192-182.3232-11.4176-9.7792-29.1328-1.9456-29.5936 13.056-0.9216 30.464-7.3216 73.3696-33.0752 102.144-0.6656-52.7872-38.144-208.384-202.4448-296.8576-23.296-12.544-51.7632 2.4576-54.1696 28.7744z"
    //         fill="#FF5D50" p-id="3479"></path>
    //       <path
    //         d="M702.2592 678.4c-4.1984-45.056-60.672-166.5536-212.6336-246.4256-10.5984-5.5808-23.0912 3.1232-21.504 15.0016 6.2464 46.848 12.9536 140.4928-24.064 184.7296 4.0448-40.3968-18.1248-73.8304-36.6592-94.3104-8.3968-9.216-23.552-4.6592-25.4976 7.68-3.5328 22.3232-12.8512 56.2688-36.5568 97.9456-42.0864 74.0352-86.9888 188.672 124.5696 294.656 10.9568 0.5632 22.1696 0.8704 33.7408 0.8704 11.2128 0 22.0672-0.3072 32.7168-0.8704 158.2592-59.4944 173.4656-177.9712 165.888-259.2768z"
    //         fill="#FFDF99" p-id="3480"></path>
    //     </svg>`,
  },
  {
    text: "JS版本",
    link: "/pages/js/",
    icon: `<svg t="1718518473654" class="icon" viewBox="0 0 2275 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" width="28" height="28"><path d="M227.555556 227.555556v580.266666h91.022222V375.466667l307.2 443.733333h91.022222V227.555556h-91.022222v432.355555L318.577778 227.555556H227.555556z m261.688888 0c0-79.644444 56.888889-136.533333 136.533334-136.533334h91.022222c79.644444 0 136.533333 56.888889 136.533333 136.533334v580.266666c0 79.644444-56.888889 136.533333-136.533333 136.533334h-91.022222c-45.511111 0-91.022222-22.755556-113.777778-56.888889L455.111111 807.822222v11.377778c0 79.644444-56.888889 136.533333-136.533333 136.533333H227.555556C147.911111 955.733333 91.022222 898.844444 91.022222 819.2V227.555556C91.022222 147.911111 147.911111 91.022222 227.555556 91.022222h91.022222c45.511111 0 91.022222 22.755556 113.777778 56.888889l56.888888 79.644445z m341.333334 0v580.266666h443.733333v-68.266666H921.6V546.133333h318.577778v-68.266666H921.6V307.2H1251.555556V227.555556H830.577778z m546.133333 250.311111v79.644444c0 22.755556-11.377778 56.888889-22.755555 79.644445 34.133333 22.755556 56.888889 68.266667 56.888888 113.777777v79.644445c0 79.644444-56.888889 136.533333-136.533333 136.533333H830.577778c-79.644444 0-136.533333-56.888889-136.533334-136.533333V227.555556c0-79.644444 56.888889-136.533333 136.533334-136.533334H1251.555556c79.644444 0 136.533333 56.888889 136.533333 136.533334v79.644444c0 34.133333-11.377778 68.266667-45.511111 102.4 22.755556 11.377778 34.133333 34.133333 34.133333 68.266667zM1308.444444 227.555556L1479.111111 807.822222h102.4l125.155556-455.111111 125.155555 455.111111h91.022222L2082.133333 227.555556h-102.4l-113.777777 455.111111-125.155556-455.111111h-91.022222l-125.155556 455.111111-113.777778-455.111111h-102.4z m341.333334-136.533334h91.022222c45.511111 0 91.022222 22.755556 125.155556 68.266667 22.755556-45.511111 68.266667-68.266667 113.777777-68.266667h102.4c91.022222 0 159.288889 91.022222 136.533334 170.666667L2048 853.333333c-11.377778 56.888889-68.266667 102.4-136.533333 102.4H1820.444444c-56.888889 0-102.4-34.133333-125.155555-79.644444-22.755556 45.511111-68.266667 79.644444-125.155556 79.644444H1479.111111c-56.888889 0-113.777778-45.511111-136.533333-102.4l-170.666667-580.266666c-22.755556-91.022222 45.511111-170.666667 136.533333-170.666667h102.4c45.511111 0 91.022222 22.755556 125.155556 68.266667 22.755556-56.888889 68.266667-79.644444 113.777778-79.644445z" fill="#F92200" p-id="15414"></path><path d="M227.555556 227.555556h91.022222l307.2 432.355555V227.555556h91.022222v580.266666h-91.022222L318.577778 375.466667v443.733333H227.555556V227.555556z m603.022222 0H1251.555556v79.644444H921.6v170.666667h318.577778v79.644444H921.6v182.044445h352.711111v79.644444H830.577778V227.555556z m477.866666 0h102.4l113.777778 455.111111 125.155556-455.111111h91.022222l125.155556 455.111111 113.777777-455.111111h102.4l-170.666666 580.266666H1820.444444l-125.155555-455.111111-125.155556 455.111111H1479.111111L1308.444444 227.555556z" fill="#FFFFFF" p-id="15415"></path></svg>`,
  },
  {
    text: "赞助",
    link: "/pages/sponsor/",
  },
];
