module.exports = [
  {
    text: "指南",
    link: "/pages/introduction/",
    items: [
      { text: "介绍", link: "/pages/introduction/" },
      { text: "快速开始", link: "/pages/start/" },
      { text: "目录结构", link: "/pages/directory/" },
      { text: "vscode文件夹详解", link: "/pages/vscode/" },
      { text: "平台配置", link: "/pages/config/" },
      { text: "布局", link: "/pages/layout/" },
      { text: "路由和菜单", link: "/pages/routerMenu/" },
      { text: "http请求", link: "/pages/request/" },
      { text: "打包和部署", link: "/pages/build/" },
      {
        text: "进阶",
        items: [
          { text: "图标", link: "/pages/icon/" },
          { text: "主题和暗黑模式", link: "/pages/theme/" },
          { text: "国际化", link: "/pages/i18n/" },
          { text: "Tailwind CSS", link: "/pages/tailwindcss/" },
          { text: "RBAC权限", link: "/pages/RBAC/" },
          { text: "类型声明", link: "/pages/typescript/" },
          { text: "单点登录", link: "/pages/sso/" },
          { text: "自定义免登录", link: "/pages/nologin/" },
          { text: "打包优化", link: "/pages/buildgood/" },
          { text: "vite预构建", link: "/pages/optimize/" },
        ],
      },
      {
        text: "生态",
        items: [
          { text: "对接平台的前后端项目", link: "/pages/opensource/" },
          { text: "函数工具库", link: "/pages/utils/" },
          { text: "组件库", link: "/pages/components/" },
          { text: "vite插件", link: "/pages/viteplugin/" },
        ],
      },
      {
        text: "其他",
        items: [
          { text: "常见问题", link: "/pages/FAQ/" },
          { text: "非平台问题跟踪记录", link: "/pages/track/" },
          { text: "git常用命令", link: "/pages/git/" },
          { text: "技术网站推荐", link: "/pages/recommendation/" },
        ],
      },
    ],
  },
  {
    text: "链接",
    items: [
      {
        text: "后端项目",
        link: "/pages/opensource/",
      },
      {
        text: "日志",
        items: [
          {
            text: "Github日志",
            link: "https://github.com/pure-admin/vue-pure-admin/releases",
          },
          {
            text: "Gitee日志",
            link: "https://gitee.com/yiming_chang/vue-pure-admin/releases",
          },
        ],
      },
      {
        text: "预览",
        items: [
          {
            text: "完整版",
            link: "https://pure-admin.github.io/vue-pure-admin/#/login",
          },
          {
            text: "精简版",
            link: "https://pure-admin-thin.netlify.app/#/login",
          },
          {
            text: "max版",
            link: "https://pure-admin.github.io/vue-pure-admin-max/#/login",
          },
          {
            text: "utils文档",
            link: "https://pure-admin-utils.netlify.app/",
          },
        ],
      },
      {
        text: "Github源码",
        items: [
          {
            text: "完整版",
            link: "https://github.com/pure-admin/vue-pure-admin",
          },
          {
            text: "精简版",
            link: "https://github.com/pure-admin/pure-admin-thin",
          },
          {
            text: "Tauri版",
            link: "https://github.com/pure-admin/tauri-pure-admin",
          },
          {
            text: "Electron版",
            link: "https://github.com/pure-admin/electron-pure-admin",
          },
          {
            text: "配套后端",
            link: "https://github.com/pure-admin/pure-admin-backend",
          },
          {
            text: "文档",
            link: "https://github.com/pure-admin/pure-admin-doc",
          },
          {
            text: "utils文档",
            link: "https://github.com/pure-admin/pure-admin-utils-docs",
          },
        ],
      },
      {
        text: "Gitee源码",
        items: [
          {
            text: "完整版",
            link: "https://gitee.com/yiming_chang/vue-pure-admin",
          },
          {
            text: "精简版",
            link: "https://gitee.com/yiming_chang/pure-admin-thin",
          },
          {
            text: "Tauri版",
            link: "https://gitee.com/yiming_chang/tauri-pure-admin",
          },
          {
            text: "Electron版",
            link: "https://gitee.com/yiming_chang/electron-pure-admin",
          },
          {
            text: "配套后端",
            link: "https://gitee.com/yiming_chang/pure-admin-backend",
          },
          {
            text: "文档",
            link: "https://gitee.com/yiming_chang/pure-admin-doc",
          },
          {
            text: "utils文档",
            link: "https://gitee.com/yiming_chang/pure-admin-utils-docs",
          },
        ],
      },
    ],
  },
  {
    text: "优质服务",
    link: "/pages/service/",
    // icon: `<svg t="1668145036658" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" width="20"
    //       height="20">
    //       <path
    //         d="M428.6976 107.3152c-6.5024 72.192-36.352 207.2576-160.256 337.408 3.6864-48.0256-7.1168-83.7632-19.0464-107.6736-6.6048-13.1584-26.0608-10.5984-28.8768 3.84-5.7344 29.44-20.5824 75.0592-57.6 137.7792-71.6288 121.3952-62.5664 459.8784 340.736 459.8784s430.4384-352.8192 373.1456-496.0256c-37.376-93.44-93.952-152.5248-128.8192-182.3232-11.4176-9.7792-29.1328-1.9456-29.5936 13.056-0.9216 30.464-7.3216 73.3696-33.0752 102.144-0.6656-52.7872-38.144-208.384-202.4448-296.8576-23.296-12.544-51.7632 2.4576-54.1696 28.7744z"
    //         fill="#FF5D50" p-id="3479"></path>
    //       <path
    //         d="M702.2592 678.4c-4.1984-45.056-60.672-166.5536-212.6336-246.4256-10.5984-5.5808-23.0912 3.1232-21.504 15.0016 6.2464 46.848 12.9536 140.4928-24.064 184.7296 4.0448-40.3968-18.1248-73.8304-36.6592-94.3104-8.3968-9.216-23.552-4.6592-25.4976 7.68-3.5328 22.3232-12.8512 56.2688-36.5568 97.9456-42.0864 74.0352-86.9888 188.672 124.5696 294.656 10.9568 0.5632 22.1696 0.8704 33.7408 0.8704 11.2128 0 22.0672-0.3072 32.7168-0.8704 158.2592-59.4944 173.4656-177.9712 165.888-259.2768z"
    //         fill="#FFDF99" p-id="3480"></path>
    //     </svg>`,
  },
  {
    text: "JS版本",
    link: "/pages/js/",
    icon: `<svg t="1720145249783" class="icon" viewBox="0 0 1962 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" width="28" height="28"><path d="M85.333333 85.333333v853.333334h1792V85.333333H85.333333m0-85.333333h1792a85.333333 85.333333 0 0 1 85.333334 85.333333v853.333334a85.333333 85.333333 0 0 1-85.333334 85.333333H85.333333a85.333333 85.333333 0 0 1-85.333333-85.333333V85.333333a85.333333 85.333333 0 0 1 85.333333-85.333333z" fill="#c73420" p-id="32177"></path><path d="M525.994667 212.992l-10.922667 3.413333H352.597333V826.026667h70.997334V288.768h66.218666a2557.738667 2557.738667 0 0 1-38.912 142.165333 192.64 192.64 0 0 1 47.786667 124.928 51.584 51.584 0 0 1-12.288 40.277334 28.16 28.16 0 0 1-18.432 5.461333 224.085333 224.085333 0 0 1-29.354667-0.853333 164.48 164.48 0 0 1 17.92 69.632 231.594667 231.594667 0 0 0 44.373334-1.365334 83.456 83.456 0 0 0 38.4-15.018666 104.490667 104.490667 0 0 0 30.72-89.6A221.482667 221.482667 0 0 0 520.533333 422.4c18.432-52.565333 40.96-121.514667 58.709334-178.858667zM678.912 405.333333h150.186667v54.613334h-150.186667z m150.186667-118.784v53.248h-150.186667V286.72z m65.536 250.538667a658.986667 658.986667 0 0 1-77.824 67.584 478.72 478.72 0 0 1-27.306667-74.410667h118.101333V216.917333H599.04V706.56a67.029333 67.029333 0 0 1-31.573333 59.392 259.84 259.84 0 0 1 34.986666 63.488c16.213333-10.24 41.813333-20.48 174.762667-54.613333a490.666667 490.666667 0 0 1-3.413333-73.728l-94.890667 21.333333v-192h40.96c32.085333 133.802667 86.698667 238.933333 188.416 294.912a291.498667 291.498667 0 0 1 53.930667-70.144 283.221333 283.221333 0 0 1-110.592-91.648 1298.474667 1298.474667 0 0 0 95.573333-68.949333z m291.498666-221.866667v118.784h-81.92V315.221333z m-81.92 313.514667v-123.733333h81.92v123.733333z m157.866667-385.706667h-234.325333v513.365334h76.458666v-54.613334h157.866667z m380.245333 72.533334h-69.802666V194.56H1489.92v120.832h-202.069333V395.946667h202.069333v322.218666c0 14.336-5.461333 19.114667-20.48 19.114667-14.336 0-64.853333 0-112.64-2.048a309.290667 309.290667 0 0 1 28.672 81.92 403.541333 403.541333 0 0 0 146.261333-14.336c30.72-12.8 40.96-34.133333 40.96-83.285333V395.946667h69.632zM1463.466667 590.506667c-21.845333-39.594667-68.266667-103.082667-101.717334-150.186667l-66.901333 35.498667c32.768 49.834667 76.458667 116.736 96.938667 156.330666z" fill="#c73420" p-id="32178"></path></svg>`,
    // icon: `<svg t="1719296160563" class="icon" viewBox="0 0 1536 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" width="28" height="28"><path d="M736 448C753.92 448 768 433.92 768 416 768 398.08 753.92 384 736 384l-128 0C590.08 384 576 398.08 576 416l0 256C576 689.92 590.08 704 608 704l128 0c17.92 0 32-14.08 32-32 0-17.92-14.08-32-32-32L640 640 640 576l96 0C753.92 576 768 561.92 768 544 768 526.08 753.92 512 736 512L640 512 640 448 736 448zM480 385.92C462.08 385.92 448 400 448 417.28l0 158.72L313.6 398.72C305.28 387.2 291.2 382.72 277.76 387.2 264.96 391.68 256 403.84 256 417.28l0 254.72C256 689.28 270.08 704 288 704 305.92 704 320 689.28 320 672L320 512.64l134.4 177.92C460.8 698.88 470.4 704 480 704c3.2 0 7.04-0.64 10.24-1.92C503.04 697.6 512 685.44 512 672L512 417.28C512 400 497.92 385.92 480 385.92zM1344 192 192 192C121.6 192 64 249.6 64 320l0 448c0 70.4 57.6 128 128 128l1152 0c70.4 0 128-57.6 128-128L1472 320C1472 249.6 1414.4 192 1344 192zM1408 768c0 35.2-28.8 64-64 64L192 832c-35.2 0-64-28.8-64-64L128 320c0-35.2 28.8-64 64-64l1152 0c35.2 0 64 28.8 64 64L1408 768zM1251.2 384c-16-5.76-34.56 1.92-40.32 18.56l-65.28 172.8-65.28-172.8c-8.96-24.32-49.92-24.32-58.88 0l-65.28 172.8-65.28-172.8C885.12 385.92 867.2 377.6 850.56 384c-16.64 6.4-24.32 24.32-18.56 40.32l94.72 250.88c8.96 24.32 49.92 24.32 58.88 0l65.28-172.8 65.28 172.8c4.48 12.16 16.64 20.48 29.44 20.48 13.44 0 24.96-8.32 29.44-20.48l94.72-250.88C1276.16 407.68 1267.84 389.76 1251.2 384z" p-id="55174" fill="#d81e06"></path></svg>`,
  },
  {
    text: "赞助",
    link: "/pages/sponsor/",
  },
];
